# GetEnumerator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctSizes..::..GetEnumerator Method
DuctSizes Class See Also
---
Returns an enumerator that iterates through a collection.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual IEnumerator<MEPSize> GetEnumerator()
```

Visual Basic
---
```text
Public Overridable Function GetEnumerator As IEnumerator(Of MEPSize)
```

Visual C++
---
```text
public:
virtual IEnumerator<MEPSize^>^ GetEnumerator()
```

# ### Return Value
An IEnumerator object that can be used to iterate through the collection.
# ### Implements
IEnumerable<(Of <(<'T>)>)>..::..GetEnumerator()()()()
# See Also
DuctSizes Class
Autodesk.Revit.DB.Mechanical Namespace